---

C#Visual BasicVisual C++

Revit 2024 API
---
ReferencePointArray..::..Item Property
ReferencePointArray Class See Also Send Feedback
---

Gets or sets a reference at a specified index within the array.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual ReferencePoint this[
    	int index
    ] { get; set; }

Visual Basic
---

    Public Overridable Property Item ( _
    	index As Integer _
    ) As ReferencePoint
    	Get
    	Set

Visual C++
---

    public:
    virtual property ReferencePoint^ Item[int index] {
    	ReferencePoint^ get (int index);
    	void set (int index, ReferencePoint^ value);
    }

#### Parameters

index
    Type: System..::..Int32The index of the reference to be set or retrieved.

#### Return Value

Returns the reference at the specified index.

# See Also

ReferencePointArray Class

Autodesk.Revit.DB Namespace